/**
 * 事前に定義された色セット
 *
 * グラデーションの始端と終端の色がタプルとして定義されている。
 */
export const backgroundGradientColors: [string, string][] = [
  ['#ff512f', '#dd2476'],
  ['#ff61d2', '#fe9090'],
  ['#72ffb6', '#10d164'],
  ['#fd8451', '#ffbd6f'],
  ['#305170', '#6dfc6b'],
  ['#00c0ff', '#4218b8'],
  ['#009245', '#fcee21'],
  ['#0100ec', '#fb36f4'],
  ['#fdabdd', '#374a5a'],
  ['#38a2d7', '#561139'],
  ['#121c84', '#8278da'],
  ['#5761b2', '#1fc5a8'],
  ['#ffdb01', '#0e197d'],
  ['#ff3e9d', '#0e1f40'],
  ['#766eff', '#00d4ff'],
  ['#9bff6e', '#00d4ff'],
  ['#ff6e94', '#00d4ff'],
  ['#ffa96e', '#00d4ff'],
  ['#ffa96e', '#ff009d'],
  ['#ffdd6e', '#ff009d'],
];
